#კომენტარის სახით ჩამოწერეთ ის სამი ტექნიკა რასაც კომპიუტერი იყენებს პრობლემების გადასაჭრელად კოდში,თითეულს მიუწერე თავიანთ ახსნა განმარტება გვერდით
#sequencing-თანმიმდევრობა sequencing უშვებს კოდს თანმიმდევრობით ზევიდან ქვევით
#iteration-გამეორება iteration  აკეთებს ჩვენ პროგრამებს უფრო ადვილს,სწრაფს და ნაკლები შეცდომა გვექნება
#selection-შერჩევა  selection არჩევს მომენტს და გამოაქ შედეგი მაგალითად smartwatches როცა უკეთია ადამიანს და მისი გულის ცემა ნორმას გადაცილდა საათები არჩევენ მოემნტს და მერე ატყობინებენ 
#ადამიანს რო მითი გულის ცემა ნორმას გადასცდა

