# მომხმარებელს შეაყვანინე ასაკი მანამ, სანამ არ შეიყვანს -1. დაბეჭდე რამდენი ადამიანი იყო არასრულწლოვანი, სრულწლოვანი, პენსიონერი. გამოიყენე while loop + if/elif/else
არასრულწლოვანი = 0
სრულწლოვანი = 0
პენსიონერი = 0
while True:
     age = int(input("Enter your age:"))
     if age == -1:
          break
     if age < 18:
         არასრულწლოვანი += 1
         print("არასრულწლოვანი")
     elif age >= 18 and age <= 64:
         სრულწლოვანი += 1
         print("სრულწლოვანი")
     else:
         პენსიონერი += 1
         print("პენსიონერი")
print(არასრულწლოვანი,სრულწლოვანი,პენსიონერი)
     
